# 데이터 분석 & 데이터 시각화

## 1. 데이터 분석
데이터 분석이란 데이터를 수집하고 조사하여 데이터 안에 있는 연관성을 발견해 유용한 정보를 발굴하는 과정을 데이터 분석이라고 합니다.

### Image Data
<center>
<img src="https://drive.google.com/uc?id=1IrosSD_FXtmuQcSvV-YUZLYTEJjB2m2U" height=400 width=600 style>
</center>

### Langauage Data
<center>
<img src="https://drive.google.com/uc?id=18Q9bFuCjKKKOh1tk1s6k-syH_EzXj1VW" height=400 width=800 >
</center>

### Tabular Data
<center>
<img src="https://drive.google.com/uc?id=1zTh1ezLojjQmPtd7sKvGRxkGvTY9AdL9" height=400 width=800 >
</center>

#### colab이란? (Jupyter notebook)
웹 브라우저 상에서 Python코드를 실행시켜주는 (저희 노트북이 아니라 구글이 제공하는 서버를 사용)

In [10]:
print('Hello World!')

Hello World!

#### 실행 단축키 
- Shift + Enter : 실행 후 다음 셀 선택
- Ctrl + Enter : 실행 후 현재 셀 유지

#### 단축키 모음
- Ctrl + M H : 단축 키 확인

추가 설정
- GPU check
- 설정으로 customize : 테마, pont-size 등등

In [18]:
## 셀의 순서에 영향을 받지 않는다.

In [19]:
number = 1
print(number)

1

In [23]:
## Google drive mount

# from google.colab import drive
# drive.mount('/content/drive')

## 판다스(Pandas)

판다스(Pandas)는 파이썬 데이터 처리를 위한 라이브러리입니다.
파이썬을 이용한 데이터 분석과 같은 작업에서 필수적인 라이브러리로 알려져 있죠.

판다스는 정형 데이터를 효율적으로 표현할 수 있는 <b>DataFrame</b> 형태로 모든 데이터를 표현합니다.
(DataFrame은 2차원 테이블 구조를 말합니다.) 

csv, excel file등을 파일을 읽고, data processing

### Tabular Data
<center>
<img src="https://drive.google.com/uc?id=1cfd4LkoTWHXOgF-QIpzVtGQXwZz1UNyR" height=400 width=800 >
</center>

In [26]:
# 주석을 작성할 경우 # 기호를 사용합니다. 셀안에서 # 이후의 내용은 주석으로 인식되어 코드에 영향을 미치지 않습니다.

# 이것은 주석입니다.
print('데이터베이스 수업') 수업을 위한 예시
print('데이터베이스 수업') # 수업을 위한 예시

SyntaxError: invalid syntax (504554937.py, line 4)

In [36]:
# 데이터 프레임 생성을 위한 pandas 라이브러리
## 라이브러리란 다른 프로그램의 구성 요소를 사용하기 위해 미리 만들어 둔 프로그램 조각 

import pandas
import pandas as pd  #as 명령어로 pd 라는 별칭 지정하기
import numpy as np

In [56]:
## csv 데이터 읽기
# df = pd.read_csv('폴더 경로')

## 예시 데이터 만들기
random_df = pd.DataFrame(np.random.randn(5, 3))
student_card = pd.DataFrame({'ID':[20190103, 20190222, 20190531],
                             'name':['Kim', 'Lee', 'Jeong'],
                             'class':['H', 'W', 'S'],
                            'score':[50,20,100]})

In [57]:
student_card

         ID   name class  score
0  20190103    Kim     H     50
1  20190222    Lee     W     20
2  20190531  Jeong     S    100

#### Pandas 유용한 method 

- df.head, df.tail
- df.info
- df.columns
- df.describe

In [58]:
student_card.head()

         ID   name class  score
0  20190103    Kim     H     50
1  20190222    Lee     W     20
2  20190531  Jeong     S    100

In [59]:
student_card.columns

Index(['ID', 'name', 'class', 'score'], dtype='object')

In [60]:
student_card.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      int64
 1   name    3 non-null      object
 2   class   3 non-null      object
 3   score   3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

In [64]:
student_card.describe() #.T

                 ID       score
count  3.000000e+00    3.000000
mean   2.019029e+07   56.666667
std    2.209170e+02   40.414519
min    2.019010e+07   20.000000
25%    2.019016e+07   35.000000
50%    2.019022e+07   50.000000
75%    2.019038e+07   75.000000
max    2.019053e+07  100.000000

In [75]:
## index value 기준으로
student_card.loc[0] # student_card.loc[1]

ID       20190103
name          Kim
class           H
score          50
Name: 0, dtype: object

In [112]:
student_card.loc[0, 'name'] # student_card.loc[0][1]
# student_card.loc[:, 'name'] # student_card.loc[0][1]

'Kim'

In [106]:
## index Slice
student_card[1:2]

         ID name class  score
1  20190222  Lee     W     20

In [113]:
## 특정 열 선택
student_card['class']

0    H
1    W
2    S
Name: class, dtype: object

In [117]:
## 여러개 열 선택
student_card[['class', 'name']]

  class   name
0     H    Kim
1     W    Lee
2     S  Jeong

In [118]:
## 조건으로 검색
student_card['score'] >= 50

0     True
1    False
2     True
Name: score, dtype: bool

In [119]:
## 조건으로 검색 후 데이터 프레임 출력
student_card[student_card['score'] >= 50]

         ID   name class  score
0  20190103    Kim     H     50
2  20190531  Jeong     S    100

In [120]:
student_card[(student_card['score'] >= 50) & (student_card['name']=='Kim')]

         ID name class  score
0  20190103  Kim     H     50

In [121]:
## 정렬기능
student_card.sort_values(by='score')

         ID   name class  score
1  20190222    Lee     W     20
0  20190103    Kim     H     50
2  20190531  Jeong     S    100

In [122]:
## 개수 count
student_card['score'].value_counts()

50     1
20     1
100    1
Name: score, dtype: int64

In [124]:
## 데이터 변경
student_card.loc[0, 'score'] = 90
student_card

         ID   name class  score
0  20190103    Kim     H     90
1  20190222    Lee     W     20
2  20190531  Jeong     S    100

In [35]:
## https://laboputer.github.io/machine-learning/2020/04/07/pandas-10minutes/